{
    "version": "https://jsonfeed.org/version/1",
    "title": "Yan",
    "description": "",
    "home_page_url": "https://hiyanxyz.github.io",
    "feed_url": "https://hiyanxyz.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "yan"
    },
    "items": [
        {
            "id": "https://hiyanxyz.github.io/lavuta.html",
            "url": "https://hiyanxyz.github.io/lavuta.html",
            "title": "Lavuta",
            "summary": "[{\"id\":1555941466744,\"type\":\"publii-paragraph\",\"content\":\"I personally like minimal and clean solutions. I have been a big fan and long-term&hellip;",
            "content_html": "[{\"id\":1555941466744,\"type\":\"publii-paragraph\",\"content\":\"I personally like minimal and clean solutions. I have been a big fan and long-term user of Laravel and Vuejs frameworks. I found them cleaner and neater than the alternatives. I also like the flexibility they give to the developer. When it comes to frontend, I had to hesitantly use Bootstrap. I found bootstrap a bit bloated and un-clean. (Probably just my personal preference) So when I found out about Tailwindcss, I was overjoyed.&nbsp;So I have been using Laravel, Vuejs and Tailwind for my recent and current projects.&nbsp;\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1593343817373,\"type\":\"publii-paragraph\",\"content\":\"I have also noticed that I am dealing with more and more bigger projects which need good planning and longer maintenance requirement.&nbsp;I guess I am right at the stage after developing web applications for nearly a decade. Gone are the days when I can just develop a simple MVC Laravel only application for my clients. So I have to up my skills to deal those big projects. Meaning I have to study and practice Modular development, Repository design pattern, Presenter design pattern and such.\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1593344102617,\"type\":\"publii-paragraph\",\"content\":\"So I have tried to create a boilerplate project which meets my future needs. Result is \\\"lavuta\\\".\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1593344205373,\"type\":\"publii-image\",\"content\":{\"image\":\"https://hiyanxyz.github.io/media/posts/9/logo.png\",\"imageHeight\":300,\"imageWidth\":300,\"alt\":\"\",\"caption\":\"\"},\"config\":{\"imageAlign\":\"center\",\"link\":{\"url\":\"\",\"noFollow\":false,\"targetBlank\":false,\"sponsored\":false,\"ugc\":false},\"advanced\":{\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1593344289170,\"type\":\"publii-paragraph\",\"content\":\"https://github.com/mrlinnth/lavuta\",\"config\":{\"textAlign\":\"center\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1593344329101,\"type\":\"publii-paragraph\",\"content\":\"Still need to polish it a bit here and there but I am happy with it so far. I will be using it for my first personal project of 2020 ;)\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}}]",
            "image": "https://hiyanxyz.github.io/media/posts/9/1.png",
            "author": {
                "name": "yan"
            },
            "tags": [
                   "Programming Related"
            ],
            "date_published": "2020-06-28T18:09:54+06:30",
            "date_modified": "2020-06-28T18:09:54+06:30"
        },
        {
            "id": "https://hiyanxyz.github.io/essay-1.html",
            "url": "https://hiyanxyz.github.io/essay-1.html",
            "title": "Essay 1",
            "summary": "[{\"id\":1589550279513,\"type\":\"publii-quote\",\"content\":{\"text\":\"Be careful when you cast out your demons that you don’t throw away the best&hellip;",
            "content_html": "[{\"id\":1589550279513,\"type\":\"publii-quote\",\"content\":{\"text\":\"Be careful when you cast out your demons that you don’t throw away the best of yourself.\",\"author\":\"Friedrich Nietzsche\"},\"config\":{\"advanced\":{\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1589551206071,\"type\":\"publii-paragraph\",\"content\":\"ပြဿနာတစ်ခု (သို့) အများနဲ့ ကြုံတိုင်း ကျွန်တော် လုပ်တတ်တာ ၂ခုရှိတယ်။&nbsp;ဆောင်းတွင်းမှာ ဝက်ဝံတစ်ကောင် အိပ်နေတတ်သလိုမျိုး ဘာဆိုဘာကိုမှ မလုပ်တော့ မကိုင်တော့ပဲ အိပ်တာရယ် နိုးတာရယ် စားစရာရှိတာစားပြီး ပြန်ခွေနေတာ လုပ်တတ်တယ်။&nbsp;ဒါမှမဟုတ် လုပ်စရာရှိတာ ဖြေရှင်းစရာရှိတာတွေထဲက တစ်ခုကိုပဲ ဇောက်ချလုပ်နေလိုက်တယ်။ ဘယ်တစ်ခုပဲလုပ်လုပ် သေချာတာတစ်ခုကတော့ ကြုံတွေ့နေတဲ့ ပြဿနာတွေ အပါအဝင် အရာအားလုံးကို ကျွန်တော် လုံးဝလျစ်လျှူရှု ထားဖြစ်တာပဲ။ အလွန်ဆုံး တစ်ယောက်တစ်လေလောက်နဲ့ ဟိုပြောဒီပြောလုပ်တာလောက်ကလွဲရင် ကျွန်တော် လူတွေအကုန်နဲ့ အဆက်အသွယ်ဖြတ်တယ်။ နောက်ဆုံး ဘယ်လို ဘယ်လိုမှ ကြုံတွေ့နေတာတွေကို ရင်မဆိုင်လို့ မရတော့ဘူးဆိုတဲ့ အခြေအနေ မဟုတ်လည်း တော်တော်ဆိုးဆိုးဝါးဝါး အခြေအနေတွေဖြစ်တော့မှ ထပြီး လုပ်ရမှာတွေ ရင်ဆိုင်ရမှာတွေကို ရင်ဆိုင် လုပ်ကိုင်ဖြစ်တယ်။\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1589552102594,\"type\":\"publii-paragraph\",\"content\":\"ပတ်ဝန်းကျင် လောကကြီး တစ်ခုလုံးကို လျစ်လျှူရှုထားလိုက်ခြင်းနဲ့ ကြုံနေရတဲ့ ပြဿနာတွေကိုပါ ကိုယ့်မှာ မရှိတော့သလိုမျိုး ယာယီသက်သာမှုတစ်ခုကို စုံမက်တာပါ။ ကိုယ့်ကို ဝါးမျိုတော့မယ့် မိစ္ဆာတွေကို အခန်းထောင့်က ဘီဒိုထဲမှာ သော့ခတ်သိမ်းထားသလိုမျိုးပါပဲ။ ခက်တာက ဆယ်စုနှစ်တစ်စုလောက် ကြာလာတဲ့အခါမှာ ဘီဒိုက မဆံ့တော့တာ ကျွန်တော့်ဟာကျွန်တော် သိလာတယ်။\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1589552416489,\"type\":\"publii-paragraph\",\"content\":\"နောက်ထပ် ခပ်ကြီးကြီး ဘီဒိုတစ်လုံးပဲ လုပ်ရမလား ... တစ်ခြားနည်းလမ်းတစ်ခုခုပဲ ပြောင်းရမလား ဆိုတာ ကျွန်တော့်ဟာ ကျွန်တော် မေးနေမိတဲ့ မေးခွန်းတစ်ခုပါ။\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}}]",
            "image": "https://hiyanxyz.github.io/media/posts/8/stijn-swinnen-qwe8TLRnG8k-unsplash.jpg",
            "author": {
                "name": "yan"
            },
            "tags": [
                   "Essay"
            ],
            "date_published": "2020-05-15T20:51:32+06:30",
            "date_modified": "2020-05-15T20:51:32+06:30"
        },
        {
            "id": "https://hiyanxyz.github.io/mm-regions-cities-package.html",
            "url": "https://hiyanxyz.github.io/mm-regions-cities-package.html",
            "title": "mm-regions-cities package",
            "summary": "ဒီတစ်ပတ်က mrlinnth/mm-regions-cities package တစ်ခုပဲ ကောင်းကောင်းလုပ်ဖြစ်တယ်ပြောရမယ်။ တစ်ခြားအလုပ်တွေက ဟိုထိ ဒီထိလောက်ပဲ။ ဘာကြောင့်လုပ်ဖြစ်လည်းလေး ရေးပြချင်လို့ပါ။ အဲဒီ package လုပ်ဖြစ်တော့မှ ကိုယ့်နိုင်ငံရဲ့ ပြည်နယ်နဲ့တိုင်းတွေဖွဲ့စည်းထားတာကိုလည်း&hellip;",
            "content_html": "<p>ဒီတစ်ပတ်က <a href=\"https://github.com/mrlinnth/mm-regions-cities\">mrlinnth/mm-regions-cities</a> package တစ်ခုပဲ ကောင်းကောင်းလုပ်ဖြစ်တယ်ပြောရမယ်။ တစ်ခြားအလုပ်တွေက ဟိုထိ ဒီထိလောက်ပဲ။ ဘာကြောင့်လုပ်ဖြစ်လည်းလေး ရေးပြချင်လို့ပါ။ အဲဒီ package လုပ်ဖြစ်တော့မှ ကိုယ့်နိုင်ငံရဲ့ ပြည်နယ်နဲ့တိုင်းတွေဖွဲ့စည်းထားတာကိုလည်း ပိုသိသွားတယ်။</p>\n<ol>\n<li>ပြည်ထောင်စုနယ်မြေ၊ တိုင်း၊ ပြည်နယ် (ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရတဲ့ တိုင်းနဲ့ ဒေသ) တစ်ခုမှာ ခရိုင်တွေရှိတယ်။</li>\n<li>ခရိုင်တစ်ခုမှာ မြို့နယ်တွေ ရှိတယ်။</li>\n<li>မြို့နယ်တစ်ခုမှာ ရပ်ကွက် (သို့) ကျေးရွာအုပ်စုတွေ ရှိတယ်။</li>\n<li>ရပ်ကွက်ကို ထပ်ခွဲထားတာမရှိပေမယ့် ကျေးရွာအုပ်စုတစ်ခုမှာ ကျေးရွာတွေ ရှိတယ်။</li>\n</ol>\n<p><img class=\"post__image post__image--center\" src=\"https://hiyanxyz.github.io/media/posts/7/2020-04-Selection_005.png\" alt=\"Myanmar Country Structural Hierarchy\" width=\"979\" height=\"265\"><em>Ref : <a href=\"https://en.wikipedia.org/wiki/Administrative_divisions_of_Myanmar\">https://en.wikipedia.org/wiki/Administrative_divisions_of_Myanmar</a></em></p>\n<p>ကျွန်တော် သိထားတာက မြို့ (city/town) က တစ်နေရာရာကနေ ပါမယ်ထင်တာ။ သို့သော်မပါဘူး။ မြို့နယ်ပဲရှိတယ်။ မြို့လို့ပြောလို့မရတဲ့ ကျေးရွာတွေရှိနေတာမို့လို့ မြို့နယ်အဆင့်နဲ့ပဲ ချုပ်ပြီးပြောလိုက်တာ ပိုမှန်တာပေါ့။ </p>\n<p>ဒါပေမယ့် ဒီနေရာမှာ ပြဿနာလေးတစ်ခုက ကျွန်တော်တို့ website developer တွေ application programmer တွေအတွက်ပေါ်လာတယ်။ ကျွန်တော်တို့ မြင်ဖူးသုံးဖူးနေတဲ့ သိနေတဲ့ form တွေမှာ လိပ်စာအပိုင်းပါလာရင် ဖြည့်ခိုင်းတာက မြို့ (city) ပဲ။ အဆင့်ပိုမယ်ဆိုရင် တိုင်း/ပြည်နယ် (state) ပဲ။ ဒီဟာတွေဖြည့်တာမှာ ကိုယ့်ဟာနဲ့ကို keyboard က ရေးပြီး ဖြည့်ကြရင်တော့ ပြဿနာမကြီးပေမယ့် ရေးရတဲ့လူတွေလွယ်အောင် ကျွန်တော်တို့က dropdown box တွေနဲ့ လုပ်ပေးကြတာများတယ်။ (ရေးရတဲ့လူတွေကို လွယ်ကူအောင် လုပ်ပေးချင်တဲ့ ရည်ရွယ်ချက်ထက် ရေးချင်ရာတွေ လျှောက်မရေးကြအောင်လို့ dropdown list လုပ်ပေးထားတယ်ဆိုရင်လည်း ပိုမှန်တယ်၊ သို့သော် ဒီကိစ္စကို နောက်မှ ပိုစ့်သီးသန့်ထပ်ပြောပါဦးမယ်)</p>\n<p>ကြုံဖူးကြမှာပါ User Registration Form တို့ Online Shopping Payment Form တို့မှာ ကိုယ်နေထိုင်တဲ့ လိပ်စာအတွက်ဖြည့်မယ်ဆိုရင် Country, State, City, Address ဆိုတာမျိုး field တွေဖြည့်ရတာ။ Country, State နဲ့ City တွေကို dropdown list နဲ့ လုပ်ပေးထားကြတာများတယ်။ ဟိုးအရင်ကတော့ country ရွေးပြီး state ရွေးလည်း တကမ္ဘာလုံးက state တွေပြတယ်။ state ရွေးပြီး city ရွေးရင်လည်း တကမ္ဘာလုံးက city တွေပြတယ်။ ကိုယ့်ဟာကိုဖြည့်တဲ့လူက မှန်အောင်ရွေးဖြည့်ကြတယ်။ ခုနောက်ပိုင်းမှာတော့ ဖြည့်တဲ့လူတွေအတွက် လွယ်အောင် အရင်ဆုံး ကိုယ်နေတဲ့ country ကိုရွေးလိုက်ရင် state ရှိတဲ့ နိုင်ငံဆို တစ်ခါတည်း state dropdown မှာပြတဲ့ list က ဒီ country မှာရှိတဲ့ states တွေပဲ ပြတော့တယ်။ State မရှိတဲ့ Country ဖြစ်ဲ့ရင်လည်း state dropdown က နှိပ်စရာမလိုတာမျိုး ဖြစ်သွားတယ်။ ထိုနည်းတူပဲ state တစ်ခုရွေးလိုက်ပြီးရင်လည်း နောက်ကရွေးရမယ့် city dropdown မှာက ဒီ state ထဲမှာရှိတဲ့ city တွေပဲ ပြပေးတယ်။ သုံးရတဲ့လူတွေအဖို့ အများကြီးတွေထဲကရွေးရတဲ့ ဒုက္ခတို့ စာအများကြီး ရိုက်ရတဲ့ အခက်အခဲတို့ မရှိတော့ဘူးပေါ့။</p>\n<p>အပေါ်မှာပြောခဲ့တဲ့ ကျွန်တော်တို့ programmer တွေအတွက် ပြဿနာဆိုတာက မြန်မာနိုင်ငံအတွက် address တွေကို အပေါ်ကလို form နဲ့ ဖြည့်ခိုင်းရင် တစ်ခြားနိုင်ငံတွေလိုမျိုး အဆင်မပြေတဲ့ ပြဿနာ။ State &gt; District &gt; Township ဆိုပြီး structure ချထားတာမို့ တစ်ခြားနိုင်ငံတွေကလို State &gt; City ဆိုပြီး လိုက်လုပ်တော့ အဆင်မပြေတော့ဘူး။ သို့သော် ဒါတွေက ကျွန်တော်တို့ code ရေးသူတွေက state တွေ district တွေ township တွေကိုစုစည်းပြီးချိတ်ဆက်ပြီး မှန်အောင် ပြပေးရင် ရတယ်။ ၃ဆင့်ဖြစ်သွားတာက ပြဿနာမဟုတ်ဘူး။ပြဿနာသည်</p>\n<ol>\n<li>လူအများက state နဲ့ city ကိုပဲ ရင်းနှီးနေပြီး သူတို့ကလည်း state နဲ့ city လောက်ပဲ ဖြည့်ချင်တာ။ မြို့နယ်ဆိုရင်တောင် တစ်ချို့ မသိချင်ကြတော့ဘူး။ ကိုယ်နေထိုင်ရာ လိပ်စာမျိုးကိုတော့ သိကြမှာမှာ သို့သော် တစ်ခြားတစ်နေရာ တစ်ပါးသူအတွက် လိပ်စာကိုဖြည့်ပေးရမယ်ဆို ဂဃဏန သိပ်မသိတော့ဘူး။ နေထိုင်တဲ့ မြို့လောက်ပဲသိရင်သိတော့မယ်။ </li>\n<li>မြို့မှာမနေထိုင်ကြသူများအတွက် လိပ်စာဖြည့်မယ်ဆိုရင် သူတို့ကြတော့ city ဆိုတာကို သူတို့လိပ်စာမှာ မရှိနေတာ။ မြို့နယ် ကျေးရွာပါမှပဲ သူတို့ဖြည့်လို့ကိုရမှာ။ မြို့မှာ မနေကြလို့ အင်တာနက်မသုံး online က ဘာမှ မလုပ်နိုင်ကြဘူးလို့ တွက်ဆရင်လည်း မှားတယ်။</li>\n<li>Programmer တွေက state, district, township တွေကို စုစည်းပြီး ပြနိုင်သော်ငြား ထို အချက်အလက်များကို မှန်မှန်ကန်ကန် ပြည့်ပြည့်စုံစုံ ရရှိနိုင်မယ့်နေရာကို မသိကြ။ ကိုယ်တွေရှာနေကြ wikipedia တို့ stackoverflow မှာ မရှိ။ Wikipedia မှာတောင် state, district လောက်ထိ စုံစုံလင်လင်ရှိပေမယ့် township တွေက စုံလင်လားဘာလား မသေချာ။</li>\n</ol>\n<p>ဒီတော့ ကျွန်တော်တို့ လုပ်ရမှာကတော့ တစ်ခြားနိုင်ငံတွေလို state ထဲမှာ city ရှိတယ်ဆိုတာမဟုတ်ပဲ state မှာ district တွေရှိပြီး district မှာ township တွေရှိတာမို့လို့ state နဲ့ city ဖြည့်ခိုင်းမယ့်အစား  state နဲ့ township ဖြည့်ခိုင်းရင် ပိုမှန်တယ်။ district တို့ city တို့ ကိုတော့ ထည့်လည်းရ မထည့်လည်းရတယ်။ ထည့်ထားရင်တော့ ကျစ်ကျစ်လစ်လစ် ပိုပြနိုင်မှာပေါ့။ State နဲ့ township ပဲ ဖြည့်ရမယ်ဆိုရင်တော့ ရန်ကုန်တိုင်း (Yangon State/Region) ရွေးလိုက်တာနဲ့ သူ့မှာရှိသမျှ township အကုန်ပြပြီး အဲထဲက ပဲ မှန်တာပြန်ရွေးရမှာပေါ့။ District တို့ City တို့ ရွေးဖို့ ပေးထားရင်တော့ ပြမယ့် township က ရွေးထားတဲ့ district, city တွေနဲ့ သက်ဆိုင်တာလောက်ပဲ ထုတ်ပြတာမျိုး ဖြစ်တော့နည်းမှာပေါ့။ သို့သော်လည်း လူတွေသည် အများကြီး ဖြည့်ရ နှိပ်ရရင်လည်း သိပ်မကြိုက်ကြပြန်ဘူး။ ဒီတော့ ရင်းနှီးပြီးသား state ရွေး၊ ပြီးရင် city ရွေးအစား state ရွေး township ရွေးလောက်ဆိုရင်ကိုပဲ အဆင်ပြေလောက်ပါပြီ။</p>\n<p>Address form မှာ ဘာတွေ ဖြည့်ခိုင်းရင် အဆင်ပြေမလဲကတော့ ဟုတ်ပြီ။ ဖြည့်ဖို့ ရွေးရမယ့် ခရိုင် (district) တွေနဲ့ မြို့နယ် (township) တွေ ပဲ ဘယ်ကဘယ်လိုရမလဲ ကျန်တော့တယ်။ Wikipedia မှာတော့ <a href=\"https://en.wikipedia.org/wiki/Districts_of_Myanmar\">Districts of Myanmar</a> ဆိုပြီး ပြထားတာရှိတယ်။ ဘယ်လောက် မှန်မလဲ ပြည့်စုံမလဲကတော့ ကျွန်တော်မသိ။ သို့သော်လည်း ဘာမှမသိတာ မရှိတာထက်တော့ ရှိတာတစ်ခုခုနဲ့ စလုပ်ရမှာပဲ။  Project တွေလုပ်နေတာမှာ address ဖြည့်ခိုင်းတဲ့ form ပါတဲ့ project က တစ်ခုမကတော့ဘူး။ အဲတာနဲ့ပဲ mm-regions-cities package ကိုလုပ်ဖြစ်တာ။ ရည်ရွယ်ချက်ကတော့ address form တစ်ခုမှာ Country မြန်မာရွေးလိုက်ရင်၊ သက်ဆိုင်ရာ State/Region တွေပြပေးနိုင်ဖို့၊ State/Region တစ်ခုရွေးလိုက်ရင် သက်ဆိုင်ရာ District သို့ City သို့ Township တွေပြပေးနိုင်ဖို့အတွက်  အထောက်အပံ့ပေးဖို့ပါ။ (ကျေးရွာ village အထိသွားနိုင်ရင်တော့ အရမ်းကောင်းမှာပေါ့လေ သို့သော်လည်း သတင်းအချက်အလက်က အဲလောက်ထိ ပြည့်ပြည့်စုံစုံရဖို့ဆိုရင်တော့ လွယ်မယ်မထင်လို့ မစဥ်းစားသေးဘူး။)</p>\n<p>ဒီအပတ်ထဲမှာ လုပ်ပြီး release လိုက်တဲ့ version 0.1.0 မှာကတော့ State/Region နဲ့ Cities တွေပဲ ပါသေးတယ်။ State list, city list တွေကို json ထုတ်ပေးတဲ့ REST API အဆင့်ပဲရှိသေးတယ်။ အသင့်တန်းသုံးလို့ရမယ့် dropdown အဆင့်ထိ မလုပ်ပေးရသေးဘူး။ ကိုယ်က vuejs သမားဆိုတော့ အနည်းဆုံး vuejs component လေးတွေလောက်ထိ လုပ်ပေးဖို့တော့ ရည်ရွယ်ထားတယ်။ ရှာဖွေစုစည်းထားတဲ့ အချက်အလက်တွေကိုတော့ လွယ်လွယ်ကူကူယူပြီး သုံးချင်ရင်သုံးလို့ရအောင် Excel (csv) file နဲ့ JSON files တွေထည့်ပေးထားတယ်။ District နဲ့ township တွေ မပါသေးဘူး။ Covid19 isolation လုပ်နေတဲ့ ကာလမှာ အဲတာတွေပါ အပြည့်အစုံပါအောင် လုပ်သွားနိုင်ဖို့တော့ ကြိုးစားသွားပါမယ်။</p>",
            "image": "https://hiyanxyz.github.io/media/posts/7/2533.jpg",
            "author": {
                "name": "yan"
            },
            "tags": [
                   "Programming Related"
            ],
            "date_published": "2020-04-17T22:15:01+06:30",
            "date_modified": "2020-04-17T22:15:01+06:30"
        },
        {
            "id": "https://hiyanxyz.github.io/the-best-is-the-enemy-of-the-good.html",
            "url": "https://hiyanxyz.github.io/the-best-is-the-enemy-of-the-good.html",
            "title": "The Best Is The Enemy Of The Good",
            "summary": "Dans ses écrits, un sage Italien Dit que le mieux est l'ennemi du bien. -&hellip;",
            "content_html": "<blockquote>\n<p>Dans ses écrits, un sage Italien<br>Dit que le mieux est l'ennemi du bien.</p>\n<p>-  Voltaire (La Bégueule)</p>\n</blockquote>\n<p>အပေါ်က စာကို ဘာသာပြန်ရင် <em>In his writings, a wise Italian</em><br><em>says that the best is the enemy of the good </em>လို့ရတယ်။ အီတလီက စကားပုံတစ်ခုနဲ့ ပတ်သက်ပြီး Voltaire က သူ့ကဗျာတစ်ပုဒ်မှာ ထည့်ရေးခဲ့တာပါ။</p>\n<p class=\"msg msg--highlight\">အပြစ်အနာမရှိပြည့်စုံနှစ်သက်ဖွယ်ဆိုတဲ့ အခြေအနေက ကောင်းမွန်တယ်ဆိုတဲ့ အခြေအနေရဲ့ အဓိကရန်သူပါ။</p>\n<p>အလုပ်လုပ်ကြတာနဲ့ ပတ်သက်ပြီး ဒီ အတွေးအခေါ်ကို လက်ခံကျင့်သုံးကြသူများတယ်။ အခုနောက်ပိုင်း ခေတ်မီနည်းပညာတွေပေါ်အခြေခံပြီး ထွက်ပေါ်လာကြတဲ့ လုပ်ငန်းအသစ်တွေ ကုန်ပစ္စည်းအသစ်တွေ ဒီခံယူချက်ကို အခြေခံထားတာ အများကြီး သိသာပါတယ်။</p>\n<p>ကျွန်တော်ကိုယ်တိုင်က ဒီအချက်ကို အပြည့်အဝမကျင့်သုံးနိုင်သေးဘူး။ အထူးသဖြင့် တစ်ပါးသူလုပ်ထားတဲ့ အလုပ်တွေနဲ့ ပတ်သက်ရင် good အဆင့်ကို လက်ခံနိုင်ပေးပေမယ့် ကိုယ်တိုင်လုပ်ရတဲ့ အလုပ်တွေမှာ တစ်ခြားလူတွေအနေနဲ့ perfect မပြောတောင် ကိုယ့်ဟာကိုတော့ best ဆိုတာမျိုးမှ ကျေနပ်တတ်တော့ အလုပ်မတွင်တာ ခဏခဏဖြစ်တယ်။ တကယ်ကတော့ ဒါလည်း ဘုရားဟောတဲ့ အရာပါပဲ။ သင့်တင့်လျောက်ပတ်အောင် နေထိုင်ကျင့်သုံးပါ ဆိုတာနဲ့ အဓိပ္ပါယ်တူတူပါပဲ။ ဘယ်အရာမှ အစွန်းမရောက်ပဲ သင့်တင့်စွာ ပြီးမြောက်မဲ့ အလုပ်တွေလုပ်နိုင်အောင် ကြိုးစားရပါဦးမယ်။</p>",
            "image": "https://hiyanxyz.github.io/media/posts/5/giorgio-trovato-aqEbZ9eZAwg-unsplash.jpg",
            "author": {
                "name": "yan"
            },
            "tags": [
                   "Thoughts"
            ],
            "date_published": "2020-04-05T13:12:10+06:30",
            "date_modified": "2020-04-05T13:12:10+06:30"
        },
        {
            "id": "https://hiyanxyz.github.io/remote-working-seems-fun.html",
            "url": "https://hiyanxyz.github.io/remote-working-seems-fun.html",
            "title": "Remote Working Seems Fun",
            "summary": "ငယ်ငယ်တုန်းကတော့ ကျောင်းမသွားရပဲ အိမ်မှာနေရရင် တော်တော်ပျော်တာ။ ကြီးလာပြီး အလုပ်လုပ်ရတော့လည်း အလုပ်မလုပ်ပဲ အိမ်မှာနေရရင်ကောင်းမယ် ခဏခဏတွေးမိတယ်။ အခုလို တကယ်တမ်း အိမ်မှာပဲနေရပြီဆိုတဲ့ အခါကျမှ ... မနက်တိုင်းရုံးချိန်အမီရောက်အောင်ကြိုးစားရတာတွေ၊ ၁နာရီအောက်ထစ်ကြာတဲ့ အစည်းအဝေးတွေ၊&hellip;",
            "content_html": "<p>ငယ်ငယ်တုန်းကတော့ ကျောင်းမသွားရပဲ အိမ်မှာနေရရင် တော်တော်ပျော်တာ။ ကြီးလာပြီး အလုပ်လုပ်ရတော့လည်း အလုပ်မလုပ်ပဲ အိမ်မှာနေရရင်ကောင်းမယ် ခဏခဏတွေးမိတယ်။ အခုလို တကယ်တမ်း အိမ်မှာပဲနေရပြီဆိုတဲ့ အခါကျမှ ...</p>\n<hr>\n<p>မနက်တိုင်းရုံးချိန်အမီရောက်အောင်ကြိုးစားရတာတွေ၊ ၁နာရီအောက်ထစ်ကြာတဲ့ အစည်းအဝေးတွေ၊ open-space office ဒုက္ခတွေ၊ cubicle office ဒုက္ခတွေ၊ ရုံးဆင်းချိန် ဘတ်စ်ကား ရထားကျပ်တာတွေ၊ အလုပ်လုပ်လို့ကောင်းနေတုန်း ဘေးနားမှာ ဟိုဟာခိုင်း ဒီဟာမေးလုပ်တဲ့လူတွေ၊ ရုံးနားကစားသောက်ဆိုင်တွေက ကိုယ်နဲ့ဓါတ်မတွေ့တာတွေ။</p>\n<p>ဒါတွေ အကုန်လွတ်ကင်းတဲ့ ကိုယ့်အိမ်ကပဲ ကိုယ့်အလုပ်တွေ ကိုယ်လုပ်ချင်ကြတဲ့ ကျွန်တော်တို့တွေ အခုလို တကယ်တမ်း လုပ်ကြရပြီ ဆိုတဲ့ အခါကျမှ ...</p>\n<hr>\n<p>အလွယ်လေးတွေးကြည့်ရင် ကိုယ့်အိမ် ကိုယ့်ယာမှာပဲ နေပြီး လုပ်စရာရှိတာလုပ်ပြီး ဝင်ငွေရှာနိုင်မယ်ဆိုတာ လူတိုင်း လိုချင်တဲ့ ဘဝတစ်ခုပါ။ အခုတော့ ဒီဘဝကြီးက အိပ်မက်မဟုတ်ပဲ တကယ်ဖြစ်လာပါပြီ။ ဘယ်လိုနေလဲ။ အဆင်ပြေကြလား။</p>",
            "image": "https://hiyanxyz.github.io/media/posts/4/tim-trad-XldFyIJM3h0-unsplash.jpg",
            "author": {
                "name": "yan"
            },
            "tags": [
                   "Thoughts"
            ],
            "date_published": "2020-04-04T22:48:21+06:30",
            "date_modified": "2020-04-04T22:48:21+06:30"
        },
        {
            "id": "https://hiyanxyz.github.io/digital-ocean-account-creation.html",
            "url": "https://hiyanxyz.github.io/digital-ocean-account-creation.html",
            "title": "Digital Ocean Account Creation",
            "summary": "[{\"id\":1586002746857,\"type\":\"publii-paragraph\",\"content\":\"Just a simple guide to assist non-tech people.\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002768272,\"type\":\"publii-paragraph\",\"content\":\"1. Register at\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002639499,\"type\":\"publii-paragraph\",\"content\":\"- DigitalOcean - The developer cloud\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002640640,\"type\":\"publii-paragraph\",\"content\":\"2.",
            "content_html": "[{\"id\":1586002746857,\"type\":\"publii-paragraph\",\"content\":\"<em>Just a simple guide to assist non-tech people.</em>\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002768272,\"type\":\"publii-paragraph\",\"content\":\"1. Register at\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002639499,\"type\":\"publii-paragraph\",\"content\":\"- <a href=\\\"https://cloud.digitalocean.com/registrations/new\\\">DigitalOcean - The developer cloud</a>\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002640640,\"type\":\"publii-paragraph\",\"content\":\"2. Enter billing info with your credit card\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002642018,\"type\":\"publii-paragraph\",\"content\":\"3. Set up team account\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002643173,\"type\":\"publii-paragraph\",\"content\":\"- <a href=\\\"https://www.digitalocean.com/docs/accounts/teams/how-to/create/\\\">How to Create Teams | DigitalOcean Product Documentation</a>\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002644278,\"type\":\"publii-paragraph\",\"content\":\"    - Do not need to check \\\"Convert your account\\\" into a team.\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002645924,\"type\":\"publii-paragraph\",\"content\":\"    - Do not need to check \\\"Secure sign-in\\\"\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002647547,\"type\":\"publii-paragraph\",\"content\":\"4. Invite team members\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002648760,\"type\":\"publii-paragraph\",\"content\":\"    - enter the emails in the textarea\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002650549,\"type\":\"publii-paragraph\",\"content\":\"    - click Invite\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002651981,\"type\":\"publii-paragraph\",\"content\":\"    - Invited user has to accept the invitation via email\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002653509,\"type\":\"publii-paragraph\",\"content\":\"5. Give the team member necessary role\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}},{\"id\":1586002655166,\"type\":\"publii-paragraph\",\"content\":\"<a href=\\\"https://www.digitalocean.com/docs/accounts/teams/how-to/manage-membership/\\\">How to Manage Team Membership | DigitalOcean Product Documentation</a>\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"},\"link\":{\"url\":\"https://www.digitalocean.com/docs/accounts/teams/how-to/manage-membership/\",\"noFollow\":false,\"targetBlank\":false,\"sponsored\":false,\"ugc\":false,\"download\":false}}},{\"id\":1586002687182,\"type\":\"publii-paragraph\",\"content\":\"    - usually \\\"Member\\\" role is enough\",\"config\":{\"textAlign\":\"left\",\"advanced\":{\"style\":\"\",\"cssClasses\":\"\",\"id\":\"\"}}}]",
            "author": {
                "name": "yan"
            },
            "tags": [
                   "Guide"
            ],
            "date_published": "2020-04-04T18:45:09+06:30",
            "date_modified": "2020-04-05T12:49:44+06:30"
        },
        {
            "id": "https://hiyanxyz.github.io/hello.html",
            "url": "https://hiyanxyz.github.io/hello.html",
            "title": "Hello",
            "summary": "hello world မင်္ဂလာပါ",
            "content_html": "<p>hello world</p>\n<p>မင်္ဂလာပါ</p>",
            "image": "https://hiyanxyz.github.io/media/posts/1/hello-i-m-nik-MAgPyHRO0AA-unsplash.jpg",
            "author": {
                "name": "yan"
            },
            "tags": [
            ],
            "date_published": "2020-03-29T21:03:38+06:30",
            "date_modified": "2020-04-04T22:15:36+06:30"
        }
    ]
}
